<?php
//////////////////////////Функция///////////////////////////////////////////////
function news_share($user_id, $db) {
    
   $db->query("UPDATE EmTechUsers SET menu = 'to_main' WHERE user_id = $user_id");

   $response="Для этого пройдите по ссылке:<br>https://vk.com/wall-150317679 и нажмите кнопку “Поделиться”  рядом с понравившейся публикацией.|photo172415877_456244307";
  
   return $response; 
}
//////////////////////////Функция///////////////////////////////////////////////
?>