<?php
//////////////////////////Функция///////////////////////////////////////////////
function news_subscribe($user_id, $db) {
    
    $db->query("UPDATE EmTechUsers SET menu = 'to_main' WHERE user_id = $user_id");

    $response="Для этого пройдите по ссылке: https://vk.com/app5748831_-150317679<br> Или нажмите на кнопку “Подписаться” на странице группы:|photo-93149630_456239281";
  
   return $response; 
}
//////////////////////////Функция///////////////////////////////////////////////
?>



